MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
// Register: PMD2
#define PMD2 PMD2
extern volatile unsigned char           PMD2                __at(0xF17);
#ifndef _LIB_BUILD
asm("PMD2 equ 0F17h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CMP1MD                 :1;
        unsigned CMP2MD                 :1;
        unsigned CMP3MD                 :1;
        unsigned TMR5MD                 :1;
        unsigned TMR6MD                 :1;
        unsigned TMR7MD                 :1;
        unsigned TMR8MD                 :1;
        unsigned TMR10MD                :1;
    };
} PMD2bits_t;
extern volatile PMD2bits_t PMD2bits __at(0xF17);
// bitfield macros
#define _PMD2_CMP1MD_POSN                                   0x0
#define _PMD2_CMP1MD_POSITION                               0x0
#define _PMD2_CMP1MD_SIZE                                   0x1
#define _PMD2_CMP1MD_LENGTH                                 0x1
#define _PMD2_CMP1MD_MASK                                   0x1
#define _PMD2_CMP2MD_POSN                                   0x1
#define _PMD2_CMP2MD_POSITION                               0x1
#define _PMD2_CMP2MD_SIZE                                   0x1
#define _PMD2_CMP2MD_LENGTH                                 0x1
#define _PMD2_CMP2MD_MASK                                   0x2
#define _PMD2_CMP3MD_POSN                                   0x2
#define _PMD2_CMP3MD_POSITION                               0x2
#define _PMD2_CMP3MD_SIZE                                   0x1
#define _PMD2_CMP3MD_LENGTH                                 0x1
#define _PMD2_CMP3MD_MASK                                   0x4
#define _PMD2_TMR5MD_POSN                                   0x3
#define _PMD2_TMR5MD_POSITION                               0x3
#define _PMD2_TMR5MD_SIZE                                   0x1
#define _PMD2_TMR5MD_LENGTH                                 0x1
#define _PMD2_TMR5MD_MASK                                   0x8
#define _PMD2_TMR6MD_POSN                                   0x4
#define _PMD2_TMR6MD_POSITION                               0x4
#define _PMD2_TMR6MD_SIZE                                   0x1
#define _PMD2_TMR6MD_LENGTH                                 0x1
#define _PMD2_TMR6MD_MASK                                   0x10
#define _PMD2_TMR7MD_POSN                                   0x5
#define _PMD2_TMR7MD_POSITION                               0x5
#define _PMD2_TMR7MD_SIZE                                   0x1
#define _PMD2_TMR7MD_LENGTH                                 0x1
#define _PMD2_TMR7MD_MASK                                   0x20
#define _PMD2_TMR8MD_POSN                                   0x6
#define _PMD2_TMR8MD_POSITION                               0x6
#define _PMD2_TMR8MD_SIZE                                   0x1
#define _PMD2_TMR8MD_LENGTH                                 0x1
#define _PMD2_TMR8MD_MASK                                   0x40
#define _PMD2_TMR10MD_POSN                                  0x7
#define _PMD2_TMR10MD_POSITION                              0x7
#define _PMD2_TMR10MD_SIZE                                  0x1
#define _PMD2_TMR10MD_LENGTH                                0x1
#define _PMD2_TMR10MD_MASK                                  0x80

// Register: PMD1
#define PMD1 PMD1
extern volatile unsigned char           PMD1                __at(0xF18);
#ifndef _LIB_BUILD
asm("PMD1 equ 0F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :1;
        unsigned TMR1MD                 :1;
        unsigned TMR2MD                 :1;
        unsigned TMR3MD                 :1;
        unsigned TMR4MD                 :1;
        unsigned RTCCMD                 :1;
        unsigned CTMUMD                 :1;
    };
} PMD1bits_t;
extern volatile PMD1bits_t PMD1bits __at(0xF18);
// bitfield macros
#define _PMD1_TMR1MD_POSN                                   0x1
#define _PMD1_TMR1MD_POSITION                               0x1
#define _PMD1_TMR1MD_SIZE                                   0x1
#define _PMD1_TMR1MD_LENGTH                                 0x1
#define _PMD1_TMR1MD_MASK                                   0x2
#define _PMD1_TMR2MD_POSN                                   0x2
#define _PMD1_TMR2MD_POSITION                               0x2
#define _PMD1_TMR2MD_SIZE                                   0x1
#define _PMD1_TMR2MD_LENGTH                                 0x1
#define _PMD1_TMR2MD_MASK                                   0x4
#define _PMD1_TMR3MD_POSN                                   0x3
#define _PMD1_TMR3MD_POSITION                               0x3
#define _PMD1_TMR3MD_SIZE                                   0x1
#define _PMD1_TMR3MD_LENGTH                                 0x1
#define _PMD1_TMR3MD_MASK                                   0x8
#define _PMD1_TMR4MD_POSN                                   0x4
#define _PMD1_TMR4MD_POSITION                               0x4
#define _PMD1_TMR4MD_SIZE                                   0x1
#define _PMD1_TMR4MD_LENGTH                                 0x1
#define _PMD1_TMR4MD_MASK                                   0x10
#define _PMD1_RTCCMD_POSN                                   0x5
#define _PMD1_RTCCMD_POSITION                               0x5
#define _PMD1_RTCCMD_SIZE                                   0x1
#define _PMD1_RTCCMD_LENGTH                                 0x1
#define _PMD1_RTCCMD_MASK                                   0x20
#define _PMD1_CTMUMD_POSN                                   0x6
#define _PMD1_CTMUMD_POSITION                               0x6
#define _PMD1_CTMUMD_SIZE                                   0x1
#define _PMD1_CTMUMD_LENGTH                                 0x1
#define _PMD1_CTMUMD_MASK                                   0x40

// Register: PMD0
#define PMD0 PMD0
extern volatile unsigned char           PMD0                __at(0xF19);
#ifndef _LIB_BUILD
asm("PMD0 equ 0F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ADCMD                  :1;
        unsigned SSP1MD                 :1;
        unsigned SSP2MD                 :1;
        unsigned UART1MD                :1;
        unsigned UART2MD                :1;
        unsigned CCP1MD                 :1;
        unsigned CCP2MD                 :1;
        unsigned CCP3MD                 :1;
    };
    struct {
        unsigned                        :1;
        unsigned SPI1MD                 :1;
        unsigned SPI2MD                 :1;
    };
} PMD0bits_t;
