MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
// Register: ANCON2
#define ANCON2 ANCON2
extern volatile unsigned char           ANCON2              __at(0xF23);
#ifndef _LIB_BUILD
asm("ANCON2 equ 0F23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL16                :1;
        unsigned ANSEL17                :1;
        unsigned ANSEL18                :1;
        unsigned ANSEL19                :1;
        unsigned ANSEL20                :1;
        unsigned ANSEL21                :1;
        unsigned ANSEL22                :1;
        unsigned ANSEL23                :1;
    };
    struct {
        unsigned PCFG16                 :1;
        unsigned PCFG17                 :1;
        unsigned PCFG18                 :1;
        unsigned PCFG19                 :1;
        unsigned PCFG20                 :1;
        unsigned PCFG21                 :1;
        unsigned PCFG22                 :1;
        unsigned PCFG23                 :1;
    };
} ANCON2bits_t;
extern volatile ANCON2bits_t ANCON2bits __at(0xF23);
// bitfield macros
#define _ANCON2_ANSEL16_POSN                                0x0
#define _ANCON2_ANSEL16_POSITION                            0x0
#define _ANCON2_ANSEL16_SIZE                                0x1
#define _ANCON2_ANSEL16_LENGTH                              0x1
#define _ANCON2_ANSEL16_MASK                                0x1
#define _ANCON2_ANSEL17_POSN                                0x1
#define _ANCON2_ANSEL17_POSITION                            0x1
#define _ANCON2_ANSEL17_SIZE                                0x1
#define _ANCON2_ANSEL17_LENGTH                              0x1
#define _ANCON2_ANSEL17_MASK                                0x2
#define _ANCON2_ANSEL18_POSN                                0x2
#define _ANCON2_ANSEL18_POSITION                            0x2
#define _ANCON2_ANSEL18_SIZE                                0x1
#define _ANCON2_ANSEL18_LENGTH                              0x1
#define _ANCON2_ANSEL18_MASK                                0x4
#define _ANCON2_ANSEL19_POSN                                0x3
#define _ANCON2_ANSEL19_POSITION                            0x3
#define _ANCON2_ANSEL19_SIZE                                0x1
#define _ANCON2_ANSEL19_LENGTH                              0x1
#define _ANCON2_ANSEL19_MASK                                0x8
#define _ANCON2_ANSEL20_POSN                                0x4
#define _ANCON2_ANSEL20_POSITION                            0x4
#define _ANCON2_ANSEL20_SIZE                                0x1
#define _ANCON2_ANSEL20_LENGTH                              0x1
#define _ANCON2_ANSEL20_MASK                                0x10
#define _ANCON2_ANSEL21_POSN                                0x5
#define _ANCON2_ANSEL21_POSITION                            0x5
#define _ANCON2_ANSEL21_SIZE                                0x1
#define _ANCON2_ANSEL21_LENGTH                              0x1
#define _ANCON2_ANSEL21_MASK                                0x20
#define _ANCON2_ANSEL22_POSN                                0x6
#define _ANCON2_ANSEL22_POSITION                            0x6
#define _ANCON2_ANSEL22_SIZE                                0x1
#define _ANCON2_ANSEL22_LENGTH                              0x1
#define _ANCON2_ANSEL22_MASK                                0x40
#define _ANCON2_ANSEL23_POSN                                0x7
#define _ANCON2_ANSEL23_POSITION                            0x7
#define _ANCON2_ANSEL23_SIZE                                0x1
#define _ANCON2_ANSEL23_LENGTH                              0x1
#define _ANCON2_ANSEL23_MASK                                0x80
#define _ANCON2_PCFG16_POSN                                 0x0
#define _ANCON2_PCFG16_POSITION                             0x0
#define _ANCON2_PCFG16_SIZE                                 0x1
#define _ANCON2_PCFG16_LENGTH                               0x1
#define _ANCON2_PCFG16_MASK                                 0x1
#define _ANCON2_PCFG17_POSN                                 0x1
#define _ANCON2_PCFG17_POSITION                             0x1
#define _ANCON2_PCFG17_SIZE                                 0x1
#define _ANCON2_PCFG17_LENGTH                               0x1
#define _ANCON2_PCFG17_MASK                                 0x2
#define _ANCON2_PCFG18_POSN                                 0x2
#define _ANCON2_PCFG18_POSITION                             0x2
#define _ANCON2_PCFG18_SIZE                                 0x1
#define _ANCON2_PCFG18_LENGTH                               0x1
#define _ANCON2_PCFG18_MASK                                 0x4
#define _ANCON2_PCFG19_POSN                                 0x3
#define _ANCON2_PCFG19_POSITION                             0x3
#define _ANCON2_PCFG19_SIZE                                 0x1
#define _ANCON2_PCFG19_LENGTH                               0x1
#define _ANCON2_PCFG19_MASK                                 0x8
#define _ANCON2_PCFG20_POSN                                 0x4
#define _ANCON2_PCFG20_POSITION                             0x4
#define _ANCON2_PCFG20_SIZE                                 0x1
#define _ANCON2_PCFG20_LENGTH                               0x1
#define _ANCON2_PCFG20_MASK                                 0x10
#define _ANCON2_PCFG21_POSN                                 0x5
#define _ANCON2_PCFG21_POSITION                             0x5
#define _ANCON2_PCFG21_SIZE                                 0x1
#define _ANCON2_PCFG21_LENGTH                               0x1
#define _ANCON2_PCFG21_MASK                                 0x20
#define _ANCON2_PCFG22_POSN                                 0x6
#define _ANCON2_PCFG22_POSITION                             0x6
#define _ANCON2_PCFG22_SIZE                                 0x1
#define _ANCON2_PCFG22_LENGTH                               0x1
#define _ANCON2_PCFG22_MASK                                 0x40
#define _ANCON2_PCFG23_POSN                                 0x7
#define _ANCON2_PCFG23_POSITION                             0x7
#define _ANCON2_PCFG23_SIZE                                 0x1
#define _ANCON2_PCFG23_LENGTH                               0x1
#define _ANCON2_PCFG23_MASK                                 0x80

// Register: ANCON1
#define ANCON1 ANCON1
extern volatile unsigned char           ANCON1              __at(0xF24);
#ifndef _LIB_BUILD
asm("ANCON1 equ 0F24h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSEL8                 :1;
        unsigned ANSEL9                 :1;
        unsigned ANSEL10                :1;
        unsigned ANSEL11                :1;
        unsigned ANSEL12                :1;
        unsigned ANSEL13                :1;
        unsigned ANSEL14                :1;
        unsigned ANSEL15                :1;
    };
    struct {
        unsigned PCFG8                  :1;
        unsigned PCFG9                  :1;
        unsigned PCFG10                 :1;
        unsigned PCFG11                 :1;
        unsigned PCFG12                 :1;
        unsigned PCFG13                 :1;
        unsigned PCFG14                 :1;
        unsigned PCFG15                 :1;
    };
} ANCON1bits_t;
