MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
// Register: LCDDATA15
#define LCDDATA15 LCDDATA15
extern volatile unsigned char           LCDDATA15           __at(0xF75);
#ifndef _LIB_BUILD
asm("LCDDATA15 equ 0F75h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C2                  :1;
        unsigned S25C2                  :1;
        unsigned S26C2                  :1;
        unsigned S27C2                  :1;
        unsigned S28C2                  :1;
        unsigned S29C2                  :1;
        unsigned S30C2                  :1;
        unsigned S31C2                  :1;
    };
} LCDDATA15bits_t;
extern volatile LCDDATA15bits_t LCDDATA15bits __at(0xF75);
// bitfield macros
#define _LCDDATA15_S24C2_POSN                               0x0
#define _LCDDATA15_S24C2_POSITION                           0x0
#define _LCDDATA15_S24C2_SIZE                               0x1
#define _LCDDATA15_S24C2_LENGTH                             0x1
#define _LCDDATA15_S24C2_MASK                               0x1
#define _LCDDATA15_S25C2_POSN                               0x1
#define _LCDDATA15_S25C2_POSITION                           0x1
#define _LCDDATA15_S25C2_SIZE                               0x1
#define _LCDDATA15_S25C2_LENGTH                             0x1
#define _LCDDATA15_S25C2_MASK                               0x2
#define _LCDDATA15_S26C2_POSN                               0x2
#define _LCDDATA15_S26C2_POSITION                           0x2
#define _LCDDATA15_S26C2_SIZE                               0x1
#define _LCDDATA15_S26C2_LENGTH                             0x1
#define _LCDDATA15_S26C2_MASK                               0x4
#define _LCDDATA15_S27C2_POSN                               0x3
#define _LCDDATA15_S27C2_POSITION                           0x3
#define _LCDDATA15_S27C2_SIZE                               0x1
#define _LCDDATA15_S27C2_LENGTH                             0x1
#define _LCDDATA15_S27C2_MASK                               0x8
#define _LCDDATA15_S28C2_POSN                               0x4
#define _LCDDATA15_S28C2_POSITION                           0x4
#define _LCDDATA15_S28C2_SIZE                               0x1
#define _LCDDATA15_S28C2_LENGTH                             0x1
#define _LCDDATA15_S28C2_MASK                               0x10
#define _LCDDATA15_S29C2_POSN                               0x5
#define _LCDDATA15_S29C2_POSITION                           0x5
#define _LCDDATA15_S29C2_SIZE                               0x1
#define _LCDDATA15_S29C2_LENGTH                             0x1
#define _LCDDATA15_S29C2_MASK                               0x20
#define _LCDDATA15_S30C2_POSN                               0x6
#define _LCDDATA15_S30C2_POSITION                           0x6
#define _LCDDATA15_S30C2_SIZE                               0x1
#define _LCDDATA15_S30C2_LENGTH                             0x1
#define _LCDDATA15_S30C2_MASK                               0x40
#define _LCDDATA15_S31C2_POSN                               0x7
#define _LCDDATA15_S31C2_POSITION                           0x7
#define _LCDDATA15_S31C2_SIZE                               0x1
#define _LCDDATA15_S31C2_LENGTH                             0x1
#define _LCDDATA15_S31C2_MASK                               0x80

// Register: LCDDATA16
#define LCDDATA16 LCDDATA16
extern volatile unsigned char           LCDDATA16           __at(0xF76);
#ifndef _LIB_BUILD
asm("LCDDATA16 equ 0F76h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C2                  :1;
        unsigned S33C2                  :1;
        unsigned S34C2                  :1;
        unsigned S35C2                  :1;
        unsigned S36C2                  :1;
        unsigned S37C2                  :1;
        unsigned S38C2                  :1;
        unsigned S39C2                  :1;
    };
    struct {
        unsigned T4CKPS016              :1;
        unsigned T4CKPS116              :1;
        unsigned                        :1;
        unsigned T4OUTPS016             :1;
        unsigned T4OUTPS116             :1;
        unsigned T4OUTPS216             :1;
        unsigned T4OUTPS316             :1;
    };
} LCDDATA16bits_t;
extern volatile LCDDATA16bits_t LCDDATA16bits __at(0xF76);
// bitfield macros
#define _LCDDATA16_S32C2_POSN                               0x0
#define _LCDDATA16_S32C2_POSITION                           0x0
#define _LCDDATA16_S32C2_SIZE                               0x1
#define _LCDDATA16_S32C2_LENGTH                             0x1
#define _LCDDATA16_S32C2_MASK                               0x1
#define _LCDDATA16_S33C2_POSN                               0x1
#define _LCDDATA16_S33C2_POSITION                           0x1
#define _LCDDATA16_S33C2_SIZE                               0x1
#define _LCDDATA16_S33C2_LENGTH                             0x1
#define _LCDDATA16_S33C2_MASK                               0x2
#define _LCDDATA16_S34C2_POSN                               0x2
#define _LCDDATA16_S34C2_POSITION                           0x2
#define _LCDDATA16_S34C2_SIZE                               0x1
#define _LCDDATA16_S34C2_LENGTH                             0x1
#define _LCDDATA16_S34C2_MASK                               0x4
#define _LCDDATA16_S35C2_POSN                               0x3
#define _LCDDATA16_S35C2_POSITION                           0x3
#define _LCDDATA16_S35C2_SIZE                               0x1
#define _LCDDATA16_S35C2_LENGTH                             0x1
#define _LCDDATA16_S35C2_MASK                               0x8
#define _LCDDATA16_S36C2_POSN                               0x4
#define _LCDDATA16_S36C2_POSITION                           0x4
#define _LCDDATA16_S36C2_SIZE                               0x1
#define _LCDDATA16_S36C2_LENGTH                             0x1
#define _LCDDATA16_S36C2_MASK                               0x10
#define _LCDDATA16_S37C2_POSN                               0x5
#define _LCDDATA16_S37C2_POSITION                           0x5
#define _LCDDATA16_S37C2_SIZE                               0x1
#define _LCDDATA16_S37C2_LENGTH                             0x1
#define _LCDDATA16_S37C2_MASK                               0x20
#define _LCDDATA16_S38C2_POSN                               0x6
#define _LCDDATA16_S38C2_POSITION                           0x6
#define _LCDDATA16_S38C2_SIZE                               0x1
#define _LCDDATA16_S38C2_LENGTH                             0x1
#define _LCDDATA16_S38C2_MASK                               0x40
#define _LCDDATA16_S39C2_POSN                               0x7
#define _LCDDATA16_S39C2_POSITION                           0x7
#define _LCDDATA16_S39C2_SIZE                               0x1
#define _LCDDATA16_S39C2_LENGTH                             0x1
#define _LCDDATA16_S39C2_MASK                               0x80
#define _LCDDATA16_T4CKPS016_POSN                           0x0
#define _LCDDATA16_T4CKPS016_POSITION                       0x0
#define _LCDDATA16_T4CKPS016_SIZE                           0x1
#define _LCDDATA16_T4CKPS016_LENGTH                         0x1
#define _LCDDATA16_T4CKPS016_MASK                           0x1
#define _LCDDATA16_T4CKPS116_POSN                           0x1
#define _LCDDATA16_T4CKPS116_POSITION                       0x1
#define _LCDDATA16_T4CKPS116_SIZE                           0x1
#define _LCDDATA16_T4CKPS116_LENGTH                         0x1
#define _LCDDATA16_T4CKPS116_MASK                           0x2
#define _LCDDATA16_T4OUTPS016_POSN                          0x3
#define _LCDDATA16_T4OUTPS016_POSITION                      0x3
#define _LCDDATA16_T4OUTPS016_SIZE                          0x1
#define _LCDDATA16_T4OUTPS016_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS016_MASK                          0x8
#define _LCDDATA16_T4OUTPS116_POSN                          0x4
#define _LCDDATA16_T4OUTPS116_POSITION                      0x4
#define _LCDDATA16_T4OUTPS116_SIZE                          0x1
#define _LCDDATA16_T4OUTPS116_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS116_MASK                          0x10
#define _LCDDATA16_T4OUTPS216_POSN                          0x5
#define _LCDDATA16_T4OUTPS216_POSITION                      0x5
#define _LCDDATA16_T4OUTPS216_SIZE                          0x1
#define _LCDDATA16_T4OUTPS216_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS216_MASK                          0x20
#define _LCDDATA16_T4OUTPS316_POSN                          0x6
#define _LCDDATA16_T4OUTPS316_POSITION                      0x6
#define _LCDDATA16_T4OUTPS316_SIZE                          0x1
#define _LCDDATA16_T4OUTPS316_LENGTH                        0x1
#define _LCDDATA16_T4OUTPS316_MASK                          0x40

