MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
#define                                 ARPT3_bit           _BIT_ACCESS(ALRMRPT,3)
// ALRMRPT<ARPT4>
extern volatile __bit                   ARPT4               __at(0x7AD4);	// @ (0xF5A * 8 + 4)
#define                                 ARPT4_bit           _BIT_ACCESS(ALRMRPT,4)
// ALRMRPT<ARPT5>
extern volatile __bit                   ARPT5               __at(0x7AD5);	// @ (0xF5A * 8 + 5)
#define                                 ARPT5_bit           _BIT_ACCESS(ALRMRPT,5)
// ALRMRPT<ARPT6>
extern volatile __bit                   ARPT6               __at(0x7AD6);	// @ (0xF5A * 8 + 6)
#define                                 ARPT6_bit           _BIT_ACCESS(ALRMRPT,6)
// ALRMRPT<ARPT7>
extern volatile __bit                   ARPT7               __at(0x7AD7);	// @ (0xF5A * 8 + 7)
#define                                 ARPT7_bit           _BIT_ACCESS(ALRMRPT,7)
// PORTJ<BA0>
extern volatile __bit                   BA0                 __at(0x7C44);	// @ (0xF88 * 8 + 4)
#define                                 BA0_bit             _BIT_ACCESS(PORTJ,4)
// PIE2<BCL1IE>
extern volatile __bit                   BCL1IE              __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCL1IE_bit          _BIT_ACCESS(PIE2,3)
// PIR2<BCL1IF>
extern volatile __bit                   BCL1IF              __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCL1IF_bit          _BIT_ACCESS(PIR2,3)
// IPR2<BCL1IP>
extern volatile __bit                   BCL1IP              __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCL1IP_bit          _BIT_ACCESS(IPR2,3)
// PIE2<BCL2IE>
extern volatile __bit                   BCL2IE              __at(0x7D04);	// @ (0xFA0 * 8 + 4)
#define                                 BCL2IE_bit          _BIT_ACCESS(PIE2,4)
// PIR2<BCL2IF>
extern volatile __bit                   BCL2IF              __at(0x7D0C);	// @ (0xFA1 * 8 + 4)
#define                                 BCL2IF_bit          _BIT_ACCESS(PIR2,4)
// IPR2<BCL2IP>
extern volatile __bit                   BCL2IP              __at(0x7D14);	// @ (0xFA2 * 8 + 4)
#define                                 BCL2IP_bit          _BIT_ACCESS(IPR2,4)
// PIE2<BCLIE>
extern volatile __bit                   BCLIE               __at(0x7D03);	// @ (0xFA0 * 8 + 3)
#define                                 BCLIE_bit           _BIT_ACCESS(PIE2,3)
// PIR2<BCLIF>
extern volatile __bit                   BCLIF               __at(0x7D0B);	// @ (0xFA1 * 8 + 3)
#define                                 BCLIF_bit           _BIT_ACCESS(PIR2,3)
// IPR2<BCLIP>
extern volatile __bit                   BCLIP               __at(0x7D13);	// @ (0xFA2 * 8 + 3)
#define                                 BCLIP_bit           _BIT_ACCESS(IPR2,3)
// SSP1STAT<BF1>
extern volatile __bit                   BF1                 __at(0x7E38);	// @ (0xFC7 * 8 + 0)
#define                                 BF1_bit             _BIT_ACCESS(SSP1STAT,0)
// SSP2STAT<BF2>
extern volatile __bit                   BF2                 __at(0x7800);	// @ (0xF00 * 8 + 0)
#define                                 BF2_bit             _BIT_ACCESS(SSP2STAT,0)
// HLVDCON<BGVST>
extern volatile __bit                   BGVST               __at(0x7D46);	// @ (0xFA8 * 8 + 6)
#define                                 BGVST_bit           _BIT_ACCESS(HLVDCON,6)
// LCDPS<BIASMD>
extern volatile __bit                   BIASMD              __at(0x77AE);	// @ (0xEF5 * 8 + 6)
#define                                 BIASMD_bit          _BIT_ACCESS(LCDPS,6)
// RCON<BOR>
extern volatile __bit                   BOR                 __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 BOR_bit             _BIT_ACCESS(RCON,0)
// BAUDCON1<BRG161>
extern volatile __bit                   BRG161              __at(0x7B2B);	// @ (0xF65 * 8 + 3)
#define                                 BRG161_bit          _BIT_ACCESS(BAUDCON1,3)
// BAUDCON2<BRG162>
extern volatile __bit                   BRG162              __at(0x7903);	// @ (0xF20 * 8 + 3)
#define                                 BRG162_bit          _BIT_ACCESS(BAUDCON2,3)
// TXSTA1<BRGH1>
extern volatile __bit                   BRGH1               __at(0x7D62);	// @ (0xFAC * 8 + 2)
#define                                 BRGH1_bit           _BIT_ACCESS(TXSTA1,2)
// TXSTA2<BRGH2>
extern volatile __bit                   BRGH2               __at(0x790A);	// @ (0xF21 * 8 + 2)
#define                                 BRGH2_bit           _BIT_ACCESS(TXSTA2,2)
// CCPTMRS2<C10TSEL0>
extern volatile __bit                   C10TSEL0            __at(0x795C);	// @ (0xF2B * 8 + 4)
#define                                 C10TSEL0_bit        _BIT_ACCESS(CCPTMRS2,4)
// CM1CON<C1CH0>
extern volatile __bit                   C1CH0               __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 C1CH0_bit           _BIT_ACCESS(CM1CON,0)
// CM1CON<C1CH1>
extern volatile __bit                   C1CH1               __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 C1CH1_bit           _BIT_ACCESS(CM1CON,1)
// PORTF<C1INA>
extern volatile __bit                   C1INA               __at(0x7C2E);	// @ (0xF85 * 8 + 6)
#define                                 C1INA_bit           _BIT_ACCESS(PORTF,6)
// PORTF<C1INB>
extern volatile __bit                   C1INB               __at(0x7C2D);	// @ (0xF85 * 8 + 5)
#define                                 C1INB_bit           _BIT_ACCESS(PORTF,5)
// PORTH<C1INC>
extern volatile __bit                   C1INC               __at(0x7C3E);	// @ (0xF87 * 8 + 6)
#define                                 C1INC_bit           _BIT_ACCESS(PORTH,6)
// PORTF<C1OUTF>
extern volatile __bit                   C1OUTF              __at(0x7C2A);	// @ (0xF85 * 8 + 2)
#define                                 C1OUTF_bit          _BIT_ACCESS(PORTF,2)
// CCPTMRS0<C1TSEL0>
extern volatile __bit                   C1TSEL0             __at(0x7968);	// @ (0xF2D * 8 + 0)
#define                                 C1TSEL0_bit         _BIT_ACCESS(CCPTMRS0,0)
// CCPTMRS0<C1TSEL1>
extern volatile __bit                   C1TSEL1             __at(0x7969);	// @ (0xF2D * 8 + 1)
#define                                 C1TSEL1_bit         _BIT_ACCESS(CCPTMRS0,1)
// CCPTMRS0<C1TSEL2>
extern volatile __bit                   C1TSEL2             __at(0x796A);	// @ (0xF2D * 8 + 2)
#define                                 C1TSEL2_bit         _BIT_ACCESS(CCPTMRS0,2)
// PORTF<C2INA>
extern volatile __bit                   C2INA               __at(0x7C2C);	// @ (0xF85 * 8 + 4)
#define                                 C2INA_bit           _BIT_ACCESS(PORTF,4)
// PORTF<C2INB>
extern volatile __bit                   C2INB               __at(0x7C2B);	// @ (0xF85 * 8 + 3)
#define                                 C2INB_bit           _BIT_ACCESS(PORTF,3)
// PORTH<C2INC>
extern volatile __bit                   C2INC               __at(0x7C3C);	// @ (0xF87 * 8 + 4)
#define                                 C2INC_bit           _BIT_ACCESS(PORTH,4)
// PORTH<C2IND>
extern volatile __bit                   C2IND               __at(0x7C3D);	// @ (0xF87 * 8 + 5)
#define                                 C2IND_bit           _BIT_ACCESS(PORTH,5)
// PORTF<C2OUTF>
extern volatile __bit                   C2OUTF              __at(0x7C29);	// @ (0xF85 * 8 + 1)
#define                                 C2OUTF_bit          _BIT_ACCESS(PORTF,1)
// CCPTMRS0<C2TSEL0>
extern volatile __bit                   C2TSEL0             __at(0x796B);	// @ (0xF2D * 8 + 3)
#define                                 C2TSEL0_bit         _BIT_ACCESS(CCPTMRS0,3)
// CCPTMRS0<C2TSEL1>
extern volatile __bit                   C2TSEL1             __at(0x796C);	// @ (0xF2D * 8 + 4)
#define                                 C2TSEL1_bit         _BIT_ACCESS(CCPTMRS0,4)
// CCPTMRS0<C2TSEL2>
extern volatile __bit                   C2TSEL2             __at(0x796D);	// @ (0xF2D * 8 + 5)
#define                                 C2TSEL2_bit         _BIT_ACCESS(CCPTMRS0,5)
// PORTG<C3INA>
extern volatile __bit                   C3INA               __at(0x7C32);	// @ (0xF86 * 8 + 2)
#define                                 C3INA_bit           _BIT_ACCESS(PORTG,2)
// PORTG<C3INB>
extern volatile __bit                   C3INB               __at(0x7C33);	// @ (0xF86 * 8 + 3)
#define                                 C3INB_bit           _BIT_ACCESS(PORTG,3)
// PORTG<C3INC>
extern volatile __bit                   C3INC               __at(0x7C34);	// @ (0xF86 * 8 + 4)
#define                                 C3INC_bit           _BIT_ACCESS(PORTG,4)
// PORTG<C3OUTG>
extern volatile __bit                   C3OUTG              __at(0x7C31);	// @ (0xF86 * 8 + 1)
#define                                 C3OUTG_bit          _BIT_ACCESS(PORTG,1)
// CCPTMRS0<C3TSEL0>
extern volatile __bit                   C3TSEL0             __at(0x796E);	// @ (0xF2D * 8 + 6)
#define                                 C3TSEL0_bit         _BIT_ACCESS(CCPTMRS0,6)
// CCPTMRS0<C3TSEL1>
extern volatile __bit                   C3TSEL1             __at(0x796F);	// @ (0xF2D * 8 + 7)
#define                                 C3TSEL1_bit         _BIT_ACCESS(CCPTMRS0,7)
// CCPTMRS1<C4TSEL0>
extern volatile __bit                   C4TSEL0             __at(0x7960);	// @ (0xF2C * 8 + 0)
#define                                 C4TSEL0_bit         _BIT_ACCESS(CCPTMRS1,0)
// CCPTMRS1<C4TSEL1>
extern volatile __bit                   C4TSEL1             __at(0x7961);	// @ (0xF2C * 8 + 1)
#define                                 C4TSEL1_bit         _BIT_ACCESS(CCPTMRS1,1)
// CCPTMRS1<C5TSEL0>
extern volatile __bit                   C5TSEL0             __at(0x7962);	// @ (0xF2C * 8 + 2)
#define                                 C5TSEL0_bit         _BIT_ACCESS(CCPTMRS1,2)
// CCPTMRS1<C6TSEL0>
extern volatile __bit                   C6TSEL0             __at(0x7964);	// @ (0xF2C * 8 + 4)
#define                                 C6TSEL0_bit         _BIT_ACCESS(CCPTMRS1,4)
// CCPTMRS1<C7TSEL0>
extern volatile __bit                   C7TSEL0             __at(0x7966);	// @ (0xF2C * 8 + 6)
#define                                 C7TSEL0_bit         _BIT_ACCESS(CCPTMRS1,6)
// CCPTMRS1<C7TSEL1>
extern volatile __bit                   C7TSEL1             __at(0x7967);	// @ (0xF2C * 8 + 7)
#define                                 C7TSEL1_bit         _BIT_ACCESS(CCPTMRS1,7)
// CCPTMRS2<C8TSEL0>
extern volatile __bit                   C8TSEL0             __at(0x7958);	// @ (0xF2B * 8 + 0)
#define                                 C8TSEL0_bit         _BIT_ACCESS(CCPTMRS2,0)
// CCPTMRS2<C8TSEL1>
extern volatile __bit                   C8TSEL1             __at(0x7959);	// @ (0xF2B * 8 + 1)
#define                                 C8TSEL1_bit         _BIT_ACCESS(CCPTMRS2,1)
// CCPTMRS2<C9TSEL0>
extern volatile __bit                   C9TSEL0             __at(0x795A);	// @ (0xF2B * 8 + 2)
#define                                 C9TSEL0_bit         _BIT_ACCESS(CCPTMRS2,2)
// RTCCAL<CAL0>
extern volatile __bit                   CAL0                __at(0x7AF0);	// @ (0xF5E * 8 + 0)
#define                                 CAL0_bit            _BIT_ACCESS(RTCCAL,0)
// TMR7L<CAL07>
extern volatile __bit                   CAL07               __at(0x79F0);	// @ (0xF3E * 8 + 0)
#define                                 CAL07_bit           _BIT_ACCESS(TMR7L,0)
// RTCCAL<CAL1>
extern volatile __bit                   CAL1                __at(0x7AF1);	// @ (0xF5E * 8 + 1)
#define                                 CAL1_bit            _BIT_ACCESS(RTCCAL,1)
// TMR7L<CAL17>
extern volatile __bit                   CAL17               __at(0x79F1);	// @ (0xF3E * 8 + 1)
#define                                 CAL17_bit           _BIT_ACCESS(TMR7L,1)
// RTCCAL<CAL2>
extern volatile __bit                   CAL2                __at(0x7AF2);	// @ (0xF5E * 8 + 2)
#define                                 CAL2_bit            _BIT_ACCESS(RTCCAL,2)
// TMR7L<CAL27>
extern volatile __bit                   CAL27               __at(0x79F2);	// @ (0xF3E * 8 + 2)
#define                                 CAL27_bit           _BIT_ACCESS(TMR7L,2)
// RTCCAL<CAL3>
extern volatile __bit                   CAL3                __at(0x7AF3);	// @ (0xF5E * 8 + 3)
#define                                 CAL3_bit            _BIT_ACCESS(RTCCAL,3)
// TMR7L<CAL37>
extern volatile __bit                   CAL37               __at(0x79F3);	// @ (0xF3E * 8 + 3)
#define                                 CAL37_bit           _BIT_ACCESS(TMR7L,3)
// RTCCAL<CAL4>
extern volatile __bit                   CAL4                __at(0x7AF4);	// @ (0xF5E * 8 + 4)
#define                                 CAL4_bit            _BIT_ACCESS(RTCCAL,4)
// TMR7L<CAL47>
extern volatile __bit                   CAL47               __at(0x79F4);	// @ (0xF3E * 8 + 4)
#define                                 CAL47_bit           _BIT_ACCESS(TMR7L,4)
// RTCCAL<CAL5>
extern volatile __bit                   CAL5                __at(0x7AF5);	// @ (0xF5E * 8 + 5)
#define                                 CAL5_bit            _BIT_ACCESS(RTCCAL,5)
// TMR7L<CAL57>
extern volatile __bit                   CAL57               __at(0x79F5);	// @ (0xF3E * 8 + 5)
#define                                 CAL57_bit           _BIT_ACCESS(TMR7L,5)
// RTCCAL<CAL6>
extern volatile __bit                   CAL6                __at(0x7AF6);	// @ (0xF5E * 8 + 6)
#define                                 CAL6_bit            _BIT_ACCESS(RTCCAL,6)
// TMR7L<CAL67>
extern volatile __bit                   CAL67               __at(0x79F6);	// @ (0xF3E * 8 + 6)
#define                                 CAL67_bit           _BIT_ACCESS(TMR7L,6)
// RTCCAL<CAL7>
extern volatile __bit                   CAL7                __at(0x7AF7);	// @ (0xF5E * 8 + 7)
#define                                 CAL7_bit            _BIT_ACCESS(RTCCAL,7)
// TMR7L<CAL77>
extern volatile __bit                   CAL77               __at(0x79F7);	// @ (0xF3E * 8 + 7)
#define                                 CAL77_bit           _BIT_ACCESS(TMR7L,7)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x7EC0);	// @ (0xFD8 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// CM1CON<CCH01>
extern volatile __bit                   CCH01               __at(0x7AA0);	// @ (0xF54 * 8 + 0)
#define                                 CCH01_bit           _BIT_ACCESS(CM1CON,0)
// CM2CON<CCH02>
extern volatile __bit                   CCH02               __at(0x7978);	// @ (0xF2F * 8 + 0)
#define                                 CCH02_bit           _BIT_ACCESS(CM2CON,0)
// CM3CON<CCH03>
extern volatile __bit                   CCH03               __at(0x7970);	// @ (0xF2E * 8 + 0)
#define                                 CCH03_bit           _BIT_ACCESS(CM3CON,0)
// IPR5<CCH05>
extern volatile __bit                   CCH05               __at(0x7E90);	// @ (0xFD2 * 8 + 0)
#define                                 CCH05_bit           _BIT_ACCESS(IPR5,0)
// CM1CON<CCH11>
extern volatile __bit                   CCH11               __at(0x7AA1);	// @ (0xF54 * 8 + 1)
#define                                 CCH11_bit           _BIT_ACCESS(CM1CON,1)
// CM2CON<CCH12>
extern volatile __bit                   CCH12               __at(0x7979);	// @ (0xF2F * 8 + 1)
#define                                 CCH12_bit           _BIT_ACCESS(CM2CON,1)
// CM3CON<CCH13>
extern volatile __bit                   CCH13               __at(0x7971);	// @ (0xF2E * 8 + 1)
#define                                 CCH13_bit           _BIT_ACCESS(CM3CON,1)
// IPR5<CCH15>
extern volatile __bit                   CCH15               __at(0x7E91);	// @ (0xFD2 * 8 + 1)
#define                                 CCH15_bit           _BIT_ACCESS(IPR5,1)
// IPR4<CCIP3IP>
extern volatile __bit                   CCIP3IP             __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCIP3IP_bit         _BIT_ACCESS(IPR4,0)
// PORTC<CCP1>
extern volatile __bit                   CCP1                __at(0x7C12);	// @ (0xF82 * 8 + 2)
#define                                 CCP1_bit            _BIT_ACCESS(PORTC,2)
// PORTE<CCP10>
extern volatile __bit                   CCP10               __at(0x7C22);	// @ (0xF84 * 8 + 2)
#define                                 CCP10_bit           _BIT_ACCESS(PORTE,2)
// PIE4<CCP10IE>
extern volatile __bit                   CCP10IE             __at(0x7DB7);	// @ (0xFB6 * 8 + 7)
#define                                 CCP10IE_bit         _BIT_ACCESS(PIE4,7)
// PIR4<CCP10IF>
extern volatile __bit                   CCP10IF             __at(0x7DBF);	// @ (0xFB7 * 8 + 7)
#define                                 CCP10IF_bit         _BIT_ACCESS(PIR4,7)
// IPR4<CCP10IP>
extern volatile __bit                   CCP10IP             __at(0x7DC7);	// @ (0xFB8 * 8 + 7)
#define                                 CCP10IP_bit         _BIT_ACCESS(IPR4,7)
// CCP10CON<CCP10M0>
extern volatile __bit                   CCP10M0             __at(0x7A00);	// @ (0xF40 * 8 + 0)
#define                                 CCP10M0_bit         _BIT_ACCESS(CCP10CON,0)
// CCP10CON<CCP10M1>
extern volatile __bit                   CCP10M1             __at(0x7A01);	// @ (0xF40 * 8 + 1)
#define                                 CCP10M1_bit         _BIT_ACCESS(CCP10CON,1)
// CCP10CON<CCP10M2>
extern volatile __bit                   CCP10M2             __at(0x7A02);	// @ (0xF40 * 8 + 2)
#define                                 CCP10M2_bit         _BIT_ACCESS(CCP10CON,2)
// CCP10CON<CCP10M3>
extern volatile __bit                   CCP10M3             __at(0x7A03);	// @ (0xF40 * 8 + 3)
#define                                 CCP10M3_bit         _BIT_ACCESS(CCP10CON,3)
// PMD3<CCP10MD>
extern volatile __bit                   CCP10MD             __at(0x78B7);	// @ (0xF16 * 8 + 7)
#define                                 CCP10MD_bit         _BIT_ACCESS(PMD3,7)
// ODCON2<CCP10OD>
extern volatile __bit                   CCP10OD             __at(0x7947);	// @ (0xF28 * 8 + 7)
#define                                 CCP10OD_bit         _BIT_ACCESS(ODCON2,7)
// CCP10CON<CCP10X>
extern volatile __bit                   CCP10X              __at(0x7A05);	// @ (0xF40 * 8 + 5)
#define                                 CCP10X_bit          _BIT_ACCESS(CCP10CON,5)
// CCP10CON<CCP10Y>
extern volatile __bit                   CCP10Y              __at(0x7A04);	// @ (0xF40 * 8 + 4)
#define                                 CCP10Y_bit          _BIT_ACCESS(CCP10CON,4)
// PIE3<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x7D19);	// @ (0xFA3 * 8 + 1)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE3,1)
// PIR3<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x7D21);	// @ (0xFA4 * 8 + 1)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR3,1)
// IPR3<CCP1IP>
extern volatile __bit                   CCP1IP              __at(0x7D29);	// @ (0xFA5 * 8 + 1)
#define                                 CCP1IP_bit          _BIT_ACCESS(IPR3,1)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0x7DD8);	// @ (0xFBB * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0x7DD9);	// @ (0xFBB * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0x7DDA);	// @ (0xFBB * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0x7DDB);	// @ (0xFBB * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// PMD0<CCP1MD>
extern volatile __bit                   CCP1MD              __at(0x78CD);	// @ (0xF19 * 8 + 5)
#define                                 CCP1MD_bit          _BIT_ACCESS(PMD0,5)
// ODCON1<CCP1OD>
extern volatile __bit                   CCP1OD              __at(0x794D);	// @ (0xF29 * 8 + 5)
#define                                 CCP1OD_bit          _BIT_ACCESS(ODCON1,5)
// CCP1CON<CCP1X>
extern volatile __bit                   CCP1X               __at(0x7DDD);	// @ (0xFBB * 8 + 5)
#define                                 CCP1X_bit           _BIT_ACCESS(CCP1CON,5)
// CCP1CON<CCP1Y>
extern volatile __bit                   CCP1Y               __at(0x7DDC);	// @ (0xFBB * 8 + 4)
#define                                 CCP1Y_bit           _BIT_ACCESS(CCP1CON,4)
// PORTE<CCP2E>
extern volatile __bit                   CCP2E               __at(0x7C27);	// @ (0xF84 * 8 + 7)
#define                                 CCP2E_bit           _BIT_ACCESS(PORTE,7)
// PIE3<CCP2IE>
extern volatile __bit                   CCP2IE              __at(0x7D1A);	// @ (0xFA3 * 8 + 2)
#define                                 CCP2IE_bit          _BIT_ACCESS(PIE3,2)
// PIR3<CCP2IF>
extern volatile __bit                   CCP2IF              __at(0x7D22);	// @ (0xFA4 * 8 + 2)
#define                                 CCP2IF_bit          _BIT_ACCESS(PIR3,2)
// IPR3<CCP2IP>
extern volatile __bit                   CCP2IP              __at(0x7D2A);	// @ (0xFA5 * 8 + 2)
#define                                 CCP2IP_bit          _BIT_ACCESS(IPR3,2)
// CCP2CON<CCP2M0>
extern volatile __bit                   CCP2M0              __at(0x7A70);	// @ (0xF4E * 8 + 0)
#define                                 CCP2M0_bit          _BIT_ACCESS(CCP2CON,0)
// CCP2CON<CCP2M1>
extern volatile __bit                   CCP2M1              __at(0x7A71);	// @ (0xF4E * 8 + 1)
#define                                 CCP2M1_bit          _BIT_ACCESS(CCP2CON,1)
// CCP2CON<CCP2M2>
extern volatile __bit                   CCP2M2              __at(0x7A72);	// @ (0xF4E * 8 + 2)
#define                                 CCP2M2_bit          _BIT_ACCESS(CCP2CON,2)
// CCP2CON<CCP2M3>
extern volatile __bit                   CCP2M3              __at(0x7A73);	// @ (0xF4E * 8 + 3)
#define                                 CCP2M3_bit          _BIT_ACCESS(CCP2CON,3)
// PMD0<CCP2MD>
extern volatile __bit                   CCP2MD              __at(0x78CE);	// @ (0xF19 * 8 + 6)
#define                                 CCP2MD_bit          _BIT_ACCESS(PMD0,6)
// ODCON1<CCP2OD>
extern volatile __bit                   CCP2OD              __at(0x794E);	// @ (0xF29 * 8 + 6)
#define                                 CCP2OD_bit          _BIT_ACCESS(ODCON1,6)
// CCP2CON<CCP2X>
extern volatile __bit                   CCP2X               __at(0x7A75);	// @ (0xF4E * 8 + 5)
#define                                 CCP2X_bit           _BIT_ACCESS(CCP2CON,5)
// CCP2CON<CCP2Y>
extern volatile __bit                   CCP2Y               __at(0x7A74);	// @ (0xF4E * 8 + 4)
#define                                 CCP2Y_bit           _BIT_ACCESS(CCP2CON,4)
// PORTB<CCP2_PA2>
extern volatile __bit                   CCP2_PA2            __at(0x7C0B);	// @ (0xF81 * 8 + 3)
#define                                 CCP2_PA2_bit        _BIT_ACCESS(PORTB,3)
// PORTG<CCP3>
extern volatile __bit                   CCP3                __at(0x7C30);	// @ (0xF86 * 8 + 0)
#define                                 CCP3_bit            _BIT_ACCESS(PORTG,0)
// PIE4<CCP3IE>
extern volatile __bit                   CCP3IE              __at(0x7DB0);	// @ (0xFB6 * 8 + 0)
#define                                 CCP3IE_bit          _BIT_ACCESS(PIE4,0)
// PIR4<CCP3IF>
extern volatile __bit                   CCP3IF              __at(0x7DB8);	// @ (0xFB7 * 8 + 0)
#define                                 CCP3IF_bit          _BIT_ACCESS(PIR4,0)
// IPR4<CCP3IP>
extern volatile __bit                   CCP3IP              __at(0x7DC0);	// @ (0xFB8 * 8 + 0)
#define                                 CCP3IP_bit          _BIT_ACCESS(IPR4,0)
