MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
// LCDDATA2<S17C0>
extern volatile __bit                   S17C0               __at(0x7B41);	// @ (0xF68 * 8 + 1)
#define                                 S17C0_bit           _BIT_ACCESS(LCDDATA2,1)
// LCDDATA8<S17C1>
extern volatile __bit                   S17C1               __at(0x7B71);	// @ (0xF6E * 8 + 1)
#define                                 S17C1_bit           _BIT_ACCESS(LCDDATA8,1)
// LCDDATA14<S17C2>
extern volatile __bit                   S17C2               __at(0x7BA1);	// @ (0xF74 * 8 + 1)
#define                                 S17C2_bit           _BIT_ACCESS(LCDDATA14,1)
// LCDDATA20<S17C3>
extern volatile __bit                   S17C3               __at(0x7BD1);	// @ (0xF7A * 8 + 1)
#define                                 S17C3_bit           _BIT_ACCESS(LCDDATA20,1)
// LCDDATA2<S18C0>
extern volatile __bit                   S18C0               __at(0x7B42);	// @ (0xF68 * 8 + 2)
#define                                 S18C0_bit           _BIT_ACCESS(LCDDATA2,2)
// LCDDATA8<S18C1>
extern volatile __bit                   S18C1               __at(0x7B72);	// @ (0xF6E * 8 + 2)
#define                                 S18C1_bit           _BIT_ACCESS(LCDDATA8,2)
// LCDDATA14<S18C2>
extern volatile __bit                   S18C2               __at(0x7BA2);	// @ (0xF74 * 8 + 2)
#define                                 S18C2_bit           _BIT_ACCESS(LCDDATA14,2)
// LCDDATA20<S18C3>
extern volatile __bit                   S18C3               __at(0x7BD2);	// @ (0xF7A * 8 + 2)
#define                                 S18C3_bit           _BIT_ACCESS(LCDDATA20,2)
// LCDDATA2<S19C0>
extern volatile __bit                   S19C0               __at(0x7B43);	// @ (0xF68 * 8 + 3)
#define                                 S19C0_bit           _BIT_ACCESS(LCDDATA2,3)
// LCDDATA8<S19C1>
extern volatile __bit                   S19C1               __at(0x7B73);	// @ (0xF6E * 8 + 3)
#define                                 S19C1_bit           _BIT_ACCESS(LCDDATA8,3)
// LCDDATA14<S19C2>
extern volatile __bit                   S19C2               __at(0x7BA3);	// @ (0xF74 * 8 + 3)
#define                                 S19C2_bit           _BIT_ACCESS(LCDDATA14,3)
// LCDDATA20<S19C3>
extern volatile __bit                   S19C3               __at(0x7BD3);	// @ (0xF7A * 8 + 3)
#define                                 S19C3_bit           _BIT_ACCESS(LCDDATA20,3)
// SSP2STAT<S2>
extern volatile __bit                   S2                  __at(0x7803);	// @ (0xF00 * 8 + 3)
#define                                 S2_bit              _BIT_ACCESS(SSP2STAT,3)
// LCDDATA2<S20C0>
extern volatile __bit                   S20C0               __at(0x7B44);	// @ (0xF68 * 8 + 4)
#define                                 S20C0_bit           _BIT_ACCESS(LCDDATA2,4)
// LCDDATA8<S20C1>
extern volatile __bit                   S20C1               __at(0x7B74);	// @ (0xF6E * 8 + 4)
#define                                 S20C1_bit           _BIT_ACCESS(LCDDATA8,4)
// LCDDATA14<S20C2>
extern volatile __bit                   S20C2               __at(0x7BA4);	// @ (0xF74 * 8 + 4)
#define                                 S20C2_bit           _BIT_ACCESS(LCDDATA14,4)
// LCDDATA20<S20C3>
extern volatile __bit                   S20C3               __at(0x7BD4);	// @ (0xF7A * 8 + 4)
#define                                 S20C3_bit           _BIT_ACCESS(LCDDATA20,4)
// LCDDATA2<S21C0>
extern volatile __bit                   S21C0               __at(0x7B45);	// @ (0xF68 * 8 + 5)
#define                                 S21C0_bit           _BIT_ACCESS(LCDDATA2,5)
// LCDDATA8<S21C1>
extern volatile __bit                   S21C1               __at(0x7B75);	// @ (0xF6E * 8 + 5)
#define                                 S21C1_bit           _BIT_ACCESS(LCDDATA8,5)
// LCDDATA14<S21C2>
extern volatile __bit                   S21C2               __at(0x7BA5);	// @ (0xF74 * 8 + 5)
#define                                 S21C2_bit           _BIT_ACCESS(LCDDATA14,5)
// LCDDATA20<S21C3>
extern volatile __bit                   S21C3               __at(0x7BD5);	// @ (0xF7A * 8 + 5)
#define                                 S21C3_bit           _BIT_ACCESS(LCDDATA20,5)
// LCDDATA2<S22C0>
extern volatile __bit                   S22C0               __at(0x7B46);	// @ (0xF68 * 8 + 6)
#define                                 S22C0_bit           _BIT_ACCESS(LCDDATA2,6)
// LCDDATA8<S22C1>
extern volatile __bit                   S22C1               __at(0x7B76);	// @ (0xF6E * 8 + 6)
#define                                 S22C1_bit           _BIT_ACCESS(LCDDATA8,6)
// LCDDATA14<S22C2>
extern volatile __bit                   S22C2               __at(0x7BA6);	// @ (0xF74 * 8 + 6)
#define                                 S22C2_bit           _BIT_ACCESS(LCDDATA14,6)
// LCDDATA20<S22C3>
extern volatile __bit                   S22C3               __at(0x7BD6);	// @ (0xF7A * 8 + 6)
#define                                 S22C3_bit           _BIT_ACCESS(LCDDATA20,6)
// LCDDATA2<S23C0>
extern volatile __bit                   S23C0               __at(0x7B47);	// @ (0xF68 * 8 + 7)
#define                                 S23C0_bit           _BIT_ACCESS(LCDDATA2,7)
// LCDDATA8<S23C1>
extern volatile __bit                   S23C1               __at(0x7B77);	// @ (0xF6E * 8 + 7)
#define                                 S23C1_bit           _BIT_ACCESS(LCDDATA8,7)
// LCDDATA14<S23C2>
extern volatile __bit                   S23C2               __at(0x7BA7);	// @ (0xF74 * 8 + 7)
#define                                 S23C2_bit           _BIT_ACCESS(LCDDATA14,7)
// LCDDATA20<S23C3>
extern volatile __bit                   S23C3               __at(0x7BD7);	// @ (0xF7A * 8 + 7)
#define                                 S23C3_bit           _BIT_ACCESS(LCDDATA20,7)
// LCDDATA3<S24C0>
extern volatile __bit                   S24C0               __at(0x7B48);	// @ (0xF69 * 8 + 0)
#define                                 S24C0_bit           _BIT_ACCESS(LCDDATA3,0)
// LCDDATA9<S24C1>
extern volatile __bit                   S24C1               __at(0x7B78);	// @ (0xF6F * 8 + 0)
#define                                 S24C1_bit           _BIT_ACCESS(LCDDATA9,0)
// LCDDATA15<S24C2>
extern volatile __bit                   S24C2               __at(0x7BA8);	// @ (0xF75 * 8 + 0)
#define                                 S24C2_bit           _BIT_ACCESS(LCDDATA15,0)
// LCDDATA21<S24C3>
extern volatile __bit                   S24C3               __at(0x7BD8);	// @ (0xF7B * 8 + 0)
#define                                 S24C3_bit           _BIT_ACCESS(LCDDATA21,0)
// LCDDATA3<S25C0>
extern volatile __bit                   S25C0               __at(0x7B49);	// @ (0xF69 * 8 + 1)
#define                                 S25C0_bit           _BIT_ACCESS(LCDDATA3,1)
// LCDDATA9<S25C1>
extern volatile __bit                   S25C1               __at(0x7B79);	// @ (0xF6F * 8 + 1)
#define                                 S25C1_bit           _BIT_ACCESS(LCDDATA9,1)
// LCDDATA15<S25C2>
extern volatile __bit                   S25C2               __at(0x7BA9);	// @ (0xF75 * 8 + 1)
#define                                 S25C2_bit           _BIT_ACCESS(LCDDATA15,1)
// LCDDATA21<S25C3>
extern volatile __bit                   S25C3               __at(0x7BD9);	// @ (0xF7B * 8 + 1)
#define                                 S25C3_bit           _BIT_ACCESS(LCDDATA21,1)
// LCDDATA3<S26C0>
extern volatile __bit                   S26C0               __at(0x7B4A);	// @ (0xF69 * 8 + 2)
#define                                 S26C0_bit           _BIT_ACCESS(LCDDATA3,2)
// LCDDATA9<S26C1>
extern volatile __bit                   S26C1               __at(0x7B7A);	// @ (0xF6F * 8 + 2)
#define                                 S26C1_bit           _BIT_ACCESS(LCDDATA9,2)
// LCDDATA15<S26C2>
extern volatile __bit                   S26C2               __at(0x7BAA);	// @ (0xF75 * 8 + 2)
#define                                 S26C2_bit           _BIT_ACCESS(LCDDATA15,2)
// LCDDATA21<S26C3>
extern volatile __bit                   S26C3               __at(0x7BDA);	// @ (0xF7B * 8 + 2)
#define                                 S26C3_bit           _BIT_ACCESS(LCDDATA21,2)
// LCDDATA3<S27C0>
extern volatile __bit                   S27C0               __at(0x7B4B);	// @ (0xF69 * 8 + 3)
#define                                 S27C0_bit           _BIT_ACCESS(LCDDATA3,3)
// LCDDATA9<S27C1>
extern volatile __bit                   S27C1               __at(0x7B7B);	// @ (0xF6F * 8 + 3)
#define                                 S27C1_bit           _BIT_ACCESS(LCDDATA9,3)
// LCDDATA15<S27C2>
extern volatile __bit                   S27C2               __at(0x7BAB);	// @ (0xF75 * 8 + 3)
#define                                 S27C2_bit           _BIT_ACCESS(LCDDATA15,3)
// LCDDATA21<S27C3>
extern volatile __bit                   S27C3               __at(0x7BDB);	// @ (0xF7B * 8 + 3)
#define                                 S27C3_bit           _BIT_ACCESS(LCDDATA21,3)
// LCDDATA3<S28C0>
extern volatile __bit                   S28C0               __at(0x7B4C);	// @ (0xF69 * 8 + 4)
#define                                 S28C0_bit           _BIT_ACCESS(LCDDATA3,4)
// LCDDATA9<S28C1>
extern volatile __bit                   S28C1               __at(0x7B7C);	// @ (0xF6F * 8 + 4)
#define                                 S28C1_bit           _BIT_ACCESS(LCDDATA9,4)
// LCDDATA15<S28C2>
extern volatile __bit                   S28C2               __at(0x7BAC);	// @ (0xF75 * 8 + 4)
#define                                 S28C2_bit           _BIT_ACCESS(LCDDATA15,4)
// LCDDATA21<S28C3>
extern volatile __bit                   S28C3               __at(0x7BDC);	// @ (0xF7B * 8 + 4)
#define                                 S28C3_bit           _BIT_ACCESS(LCDDATA21,4)
// LCDDATA3<S29C0>
extern volatile __bit                   S29C0               __at(0x7B4D);	// @ (0xF69 * 8 + 5)
#define                                 S29C0_bit           _BIT_ACCESS(LCDDATA3,5)
// LCDDATA9<S29C1>
extern volatile __bit                   S29C1               __at(0x7B7D);	// @ (0xF6F * 8 + 5)
#define                                 S29C1_bit           _BIT_ACCESS(LCDDATA9,5)
// LCDDATA15<S29C2>
extern volatile __bit                   S29C2               __at(0x7BAD);	// @ (0xF75 * 8 + 5)
#define                                 S29C2_bit           _BIT_ACCESS(LCDDATA15,5)
// LCDDATA21<S29C3>
extern volatile __bit                   S29C3               __at(0x7BDD);	// @ (0xF7B * 8 + 5)
#define                                 S29C3_bit           _BIT_ACCESS(LCDDATA21,5)
// LCDDATA3<S30C0>
extern volatile __bit                   S30C0               __at(0x7B4E);	// @ (0xF69 * 8 + 6)
#define                                 S30C0_bit           _BIT_ACCESS(LCDDATA3,6)
// LCDDATA9<S30C1>
extern volatile __bit                   S30C1               __at(0x7B7E);	// @ (0xF6F * 8 + 6)
#define                                 S30C1_bit           _BIT_ACCESS(LCDDATA9,6)
// LCDDATA15<S30C2>
extern volatile __bit                   S30C2               __at(0x7BAE);	// @ (0xF75 * 8 + 6)
#define                                 S30C2_bit           _BIT_ACCESS(LCDDATA15,6)
// LCDDATA21<S30C3>
extern volatile __bit                   S30C3               __at(0x7BDE);	// @ (0xF7B * 8 + 6)
#define                                 S30C3_bit           _BIT_ACCESS(LCDDATA21,6)
// LCDDATA3<S31C0>
extern volatile __bit                   S31C0               __at(0x7B4F);	// @ (0xF69 * 8 + 7)
#define                                 S31C0_bit           _BIT_ACCESS(LCDDATA3,7)
// LCDDATA9<S31C1>
extern volatile __bit                   S31C1               __at(0x7B7F);	// @ (0xF6F * 8 + 7)
#define                                 S31C1_bit           _BIT_ACCESS(LCDDATA9,7)
// LCDDATA15<S31C2>
extern volatile __bit                   S31C2               __at(0x7BAF);	// @ (0xF75 * 8 + 7)
#define                                 S31C2_bit           _BIT_ACCESS(LCDDATA15,7)
// LCDDATA21<S31C3>
extern volatile __bit                   S31C3               __at(0x7BDF);	// @ (0xF7B * 8 + 7)
#define                                 S31C3_bit           _BIT_ACCESS(LCDDATA21,7)
// LCDDATA4<S32C0>
extern volatile __bit                   S32C0               __at(0x7B50);	// @ (0xF6A * 8 + 0)
#define                                 S32C0_bit           _BIT_ACCESS(LCDDATA4,0)
// LCDDATA10<S32C1>
extern volatile __bit                   S32C1               __at(0x7B80);	// @ (0xF70 * 8 + 0)
#define                                 S32C1_bit           _BIT_ACCESS(LCDDATA10,0)
// LCDDATA16<S32C2>
extern volatile __bit                   S32C2               __at(0x7BB0);	// @ (0xF76 * 8 + 0)
#define                                 S32C2_bit           _BIT_ACCESS(LCDDATA16,0)
// LCDDATA22<S32C3>
extern volatile __bit                   S32C3               __at(0x7BE0);	// @ (0xF7C * 8 + 0)
#define                                 S32C3_bit           _BIT_ACCESS(LCDDATA22,0)
// LCDDATA4<S33C0>
extern volatile __bit                   S33C0               __at(0x7B51);	// @ (0xF6A * 8 + 1)
#define                                 S33C0_bit           _BIT_ACCESS(LCDDATA4,1)
// LCDDATA10<S33C1>
extern volatile __bit                   S33C1               __at(0x7B81);	// @ (0xF70 * 8 + 1)
#define                                 S33C1_bit           _BIT_ACCESS(LCDDATA10,1)
// LCDDATA16<S33C2>
extern volatile __bit                   S33C2               __at(0x7BB1);	// @ (0xF76 * 8 + 1)
#define                                 S33C2_bit           _BIT_ACCESS(LCDDATA16,1)
// LCDDATA22<S33C3>
extern volatile __bit                   S33C3               __at(0x7BE1);	// @ (0xF7C * 8 + 1)
#define                                 S33C3_bit           _BIT_ACCESS(LCDDATA22,1)
// LCDDATA4<S34C0>
extern volatile __bit                   S34C0               __at(0x7B52);	// @ (0xF6A * 8 + 2)
#define                                 S34C0_bit           _BIT_ACCESS(LCDDATA4,2)
// LCDDATA10<S34C1>
extern volatile __bit                   S34C1               __at(0x7B82);	// @ (0xF70 * 8 + 2)
#define                                 S34C1_bit           _BIT_ACCESS(LCDDATA10,2)
// LCDDATA16<S34C2>
extern volatile __bit                   S34C2               __at(0x7BB2);	// @ (0xF76 * 8 + 2)
#define                                 S34C2_bit           _BIT_ACCESS(LCDDATA16,2)
// LCDDATA22<S34C3>
extern volatile __bit                   S34C3               __at(0x7BE2);	// @ (0xF7C * 8 + 2)
#define                                 S34C3_bit           _BIT_ACCESS(LCDDATA22,2)
// LCDDATA4<S35C0>
extern volatile __bit                   S35C0               __at(0x7B53);	// @ (0xF6A * 8 + 3)
#define                                 S35C0_bit           _BIT_ACCESS(LCDDATA4,3)
// LCDDATA10<S35C1>
extern volatile __bit                   S35C1               __at(0x7B83);	// @ (0xF70 * 8 + 3)
#define                                 S35C1_bit           _BIT_ACCESS(LCDDATA10,3)
// LCDDATA16<S35C2>
extern volatile __bit                   S35C2               __at(0x7BB3);	// @ (0xF76 * 8 + 3)
#define                                 S35C2_bit           _BIT_ACCESS(LCDDATA16,3)
// LCDDATA22<S35C3>
extern volatile __bit                   S35C3               __at(0x7BE3);	// @ (0xF7C * 8 + 3)
#define                                 S35C3_bit           _BIT_ACCESS(LCDDATA22,3)
// LCDDATA4<S36C0>
extern volatile __bit                   S36C0               __at(0x7B54);	// @ (0xF6A * 8 + 4)
#define                                 S36C0_bit           _BIT_ACCESS(LCDDATA4,4)
// LCDDATA10<S36C1>
extern volatile __bit                   S36C1               __at(0x7B84);	// @ (0xF70 * 8 + 4)
#define                                 S36C1_bit           _BIT_ACCESS(LCDDATA10,4)
// LCDDATA16<S36C2>
extern volatile __bit                   S36C2               __at(0x7BB4);	// @ (0xF76 * 8 + 4)
#define                                 S36C2_bit           _BIT_ACCESS(LCDDATA16,4)
// LCDDATA22<S36C3>
extern volatile __bit                   S36C3               __at(0x7BE4);	// @ (0xF7C * 8 + 4)
#define                                 S36C3_bit           _BIT_ACCESS(LCDDATA22,4)
// LCDDATA4<S37C0>
extern volatile __bit                   S37C0               __at(0x7B55);	// @ (0xF6A * 8 + 5)
#define                                 S37C0_bit           _BIT_ACCESS(LCDDATA4,5)
// LCDDATA10<S37C1>
extern volatile __bit                   S37C1               __at(0x7B85);	// @ (0xF70 * 8 + 5)
#define                                 S37C1_bit           _BIT_ACCESS(LCDDATA10,5)
// LCDDATA16<S37C2>
extern volatile __bit                   S37C2               __at(0x7BB5);	// @ (0xF76 * 8 + 5)
#define                                 S37C2_bit           _BIT_ACCESS(LCDDATA16,5)
// LCDDATA22<S37C3>
extern volatile __bit                   S37C3               __at(0x7BE5);	// @ (0xF7C * 8 + 5)
#define                                 S37C3_bit           _BIT_ACCESS(LCDDATA22,5)
// LCDDATA4<S38C0>
extern volatile __bit                   S38C0               __at(0x7B56);	// @ (0xF6A * 8 + 6)
#define                                 S38C0_bit           _BIT_ACCESS(LCDDATA4,6)
// LCDDATA10<S38C1>
extern volatile __bit                   S38C1               __at(0x7B86);	// @ (0xF70 * 8 + 6)
#define                                 S38C1_bit           _BIT_ACCESS(LCDDATA10,6)
// LCDDATA16<S38C2>
extern volatile __bit                   S38C2               __at(0x7BB6);	// @ (0xF76 * 8 + 6)
#define                                 S38C2_bit           _BIT_ACCESS(LCDDATA16,6)
// LCDDATA22<S38C3>
extern volatile __bit                   S38C3               __at(0x7BE6);	// @ (0xF7C * 8 + 6)
#define                                 S38C3_bit           _BIT_ACCESS(LCDDATA22,6)
// LCDDATA4<S39C0>
extern volatile __bit                   S39C0               __at(0x7B57);	// @ (0xF6A * 8 + 7)
#define                                 S39C0_bit           _BIT_ACCESS(LCDDATA4,7)
// LCDDATA10<S39C1>
extern volatile __bit                   S39C1               __at(0x7B87);	// @ (0xF70 * 8 + 7)
#define                                 S39C1_bit           _BIT_ACCESS(LCDDATA10,7)
// LCDDATA16<S39C2>
extern volatile __bit                   S39C2               __at(0x7BB7);	// @ (0xF76 * 8 + 7)
#define                                 S39C2_bit           _BIT_ACCESS(LCDDATA16,7)
// LCDDATA22<S39C3>
extern volatile __bit                   S39C3               __at(0x7BE7);	// @ (0xF7C * 8 + 7)
#define                                 S39C3_bit           _BIT_ACCESS(LCDDATA22,7)
// LCDDATA5<S40C0>
extern volatile __bit                   S40C0               __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 S40C0_bit           _BIT_ACCESS(LCDDATA5,0)
// LCDDATA11<S40C1>
extern volatile __bit                   S40C1               __at(0x7B88);	// @ (0xF71 * 8 + 0)
#define                                 S40C1_bit           _BIT_ACCESS(LCDDATA11,0)
// LCDDATA5<S40C15>
extern volatile __bit                   S40C15              __at(0x7B58);	// @ (0xF6B * 8 + 0)
#define                                 S40C15_bit          _BIT_ACCESS(LCDDATA5,0)
// LCDDATA17<S40C2>
extern volatile __bit                   S40C2               __at(0x7BB8);	// @ (0xF77 * 8 + 0)
#define                                 S40C2_bit           _BIT_ACCESS(LCDDATA17,0)
// LCDDATA23<S40C3>
extern volatile __bit                   S40C3               __at(0x7BE8);	// @ (0xF7D * 8 + 0)
#define                                 S40C3_bit           _BIT_ACCESS(LCDDATA23,0)
// LCDDATA5<S41C0>
extern volatile __bit                   S41C0               __at(0x7B59);	// @ (0xF6B * 8 + 1)
#define                                 S41C0_bit           _BIT_ACCESS(LCDDATA5,1)
// LCDDATA11<S41C1>
extern volatile __bit                   S41C1               __at(0x7B89);	// @ (0xF71 * 8 + 1)
#define                                 S41C1_bit           _BIT_ACCESS(LCDDATA11,1)
// LCDDATA17<S41C2>
extern volatile __bit                   S41C2               __at(0x7BB9);	// @ (0xF77 * 8 + 1)
#define                                 S41C2_bit           _BIT_ACCESS(LCDDATA17,1)
// LCDDATA23<S41C3>
extern volatile __bit                   S41C3               __at(0x7BE9);	// @ (0xF7D * 8 + 1)
#define                                 S41C3_bit           _BIT_ACCESS(LCDDATA23,1)
// LCDDATA5<S42C0>
extern volatile __bit                   S42C0               __at(0x7B5A);	// @ (0xF6B * 8 + 2)
#define                                 S42C0_bit           _BIT_ACCESS(LCDDATA5,2)
// LCDDATA11<S42C1>
extern volatile __bit                   S42C1               __at(0x7B8A);	// @ (0xF71 * 8 + 2)
#define                                 S42C1_bit           _BIT_ACCESS(LCDDATA11,2)
// LCDDATA17<S42C2>
extern volatile __bit                   S42C2               __at(0x7BBA);	// @ (0xF77 * 8 + 2)
#define                                 S42C2_bit           _BIT_ACCESS(LCDDATA17,2)
// LCDDATA23<S42C3>
extern volatile __bit                   S42C3               __at(0x7BEA);	// @ (0xF7D * 8 + 2)
#define                                 S42C3_bit           _BIT_ACCESS(LCDDATA23,2)
// LCDDATA5<S43C0>
extern volatile __bit                   S43C0               __at(0x7B5B);	// @ (0xF6B * 8 + 3)
#define                                 S43C0_bit           _BIT_ACCESS(LCDDATA5,3)
// LCDDATA11<S43C1>
extern volatile __bit                   S43C1               __at(0x7B8B);	// @ (0xF71 * 8 + 3)
#define                                 S43C1_bit           _BIT_ACCESS(LCDDATA11,3)
// LCDDATA17<S43C2>
extern volatile __bit                   S43C2               __at(0x7BBB);	// @ (0xF77 * 8 + 3)
#define                                 S43C2_bit           _BIT_ACCESS(LCDDATA17,3)
// LCDDATA23<S43C3>
extern volatile __bit                   S43C3               __at(0x7BEB);	// @ (0xF7D * 8 + 3)
#define                                 S43C3_bit           _BIT_ACCESS(LCDDATA23,3)
// LCDDATA5<S44C0>
extern volatile __bit                   S44C0               __at(0x7B5C);	// @ (0xF6B * 8 + 4)
#define                                 S44C0_bit           _BIT_ACCESS(LCDDATA5,4)
// LCDDATA11<S44C1>
extern volatile __bit                   S44C1               __at(0x7B8C);	// @ (0xF71 * 8 + 4)
#define                                 S44C1_bit           _BIT_ACCESS(LCDDATA11,4)
// LCDDATA17<S44C2>
extern volatile __bit                   S44C2               __at(0x7BBC);	// @ (0xF77 * 8 + 4)
#define                                 S44C2_bit           _BIT_ACCESS(LCDDATA17,4)
// LCDDATA23<S44C3>
extern volatile __bit                   S44C3               __at(0x7BEC);	// @ (0xF7D * 8 + 4)
#define                                 S44C3_bit           _BIT_ACCESS(LCDDATA23,4)
// LCDDATA5<S45C0>
extern volatile __bit                   S45C0               __at(0x7B5D);	// @ (0xF6B * 8 + 5)
#define                                 S45C0_bit           _BIT_ACCESS(LCDDATA5,5)
// LCDDATA11<S45C1>
extern volatile __bit                   S45C1               __at(0x7B8D);	// @ (0xF71 * 8 + 5)
#define                                 S45C1_bit           _BIT_ACCESS(LCDDATA11,5)
// LCDDATA17<S45C2>
extern volatile __bit                   S45C2               __at(0x7BBD);	// @ (0xF77 * 8 + 5)
#define                                 S45C2_bit           _BIT_ACCESS(LCDDATA17,5)
// LCDDATA23<S45C3>
extern volatile __bit                   S45C3               __at(0x7BED);	// @ (0xF7D * 8 + 5)
#define                                 S45C3_bit           _BIT_ACCESS(LCDDATA23,5)
// LCDDATA5<S46C0>
extern volatile __bit                   S46C0               __at(0x7B5E);	// @ (0xF6B * 8 + 6)
#define                                 S46C0_bit           _BIT_ACCESS(LCDDATA5,6)
// LCDDATA11<S46C1>
extern volatile __bit                   S46C1               __at(0x7B8E);	// @ (0xF71 * 8 + 6)
#define                                 S46C1_bit           _BIT_ACCESS(LCDDATA11,6)
// LCDDATA17<S46C2>
