MikroElektronika/core_packages/PIC/XC8/def/PIC18F86K90/mcu.h
// TXSTA2<TXEN2>
extern volatile __bit                   TXEN2               __at(0x790D);	// @ (0xF21 * 8 + 5)
#define                                 TXEN2_bit           _BIT_ACCESS(TXSTA2,5)
// PIE1<TXIE>
extern volatile __bit                   TXIE                __at(0x7CEC);	// @ (0xF9D * 8 + 4)
#define                                 TXIE_bit            _BIT_ACCESS(PIE1,4)
// PIR1<TXIF>
extern volatile __bit                   TXIF                __at(0x7CF4);	// @ (0xF9E * 8 + 4)
#define                                 TXIF_bit            _BIT_ACCESS(PIR1,4)
// IPR1<TXIP>
extern volatile __bit                   TXIP                __at(0x7CFC);	// @ (0xF9F * 8 + 4)
#define                                 TXIP_bit            _BIT_ACCESS(IPR1,4)
// ODCON3<U1OD>
extern volatile __bit                   U1OD                __at(0x793E);	// @ (0xF27 * 8 + 6)
#define                                 U1OD_bit            _BIT_ACCESS(ODCON3,6)
// ODCON3<U2OD>
extern volatile __bit                   U2OD                __at(0x793F);	// @ (0xF27 * 8 + 7)
#define                                 U2OD_bit            _BIT_ACCESS(ODCON3,7)
// SSP1STAT<UA1>
extern volatile __bit                   UA1                 __at(0x7E39);	// @ (0xFC7 * 8 + 1)
#define                                 UA1_bit             _BIT_ACCESS(SSP1STAT,1)
// SSP2STAT<UA2>
extern volatile __bit                   UA2                 __at(0x7801);	// @ (0xF00 * 8 + 1)
#define                                 UA2_bit             _BIT_ACCESS(SSP2STAT,1)
// PMD0<UART1MD>
extern volatile __bit                   UART1MD             __at(0x78CB);	// @ (0xF19 * 8 + 3)
#define                                 UART1MD_bit         _BIT_ACCESS(PMD0,3)
// PMD0<UART2MD>
extern volatile __bit                   UART2MD             __at(0x78CC);	// @ (0xF19 * 8 + 4)
#define                                 UART2MD_bit         _BIT_ACCESS(PMD0,4)
// PORTJ<UB>
extern volatile __bit                   UB                  __at(0x7C47);	// @ (0xF88 * 8 + 7)
#define                                 UB_bit              _BIT_ACCESS(PORTJ,7)
// WDTCON<ULPEN>
extern volatile __bit                   ULPEN               __at(0x7E8A);	// @ (0xFD1 * 8 + 2)
#define                                 ULPEN_bit           _BIT_ACCESS(WDTCON,2)
// WDTCON<ULPLVL>
extern volatile __bit                   ULPLVL              __at(0x7E8D);	// @ (0xFD1 * 8 + 5)
#define                                 ULPLVL_bit          _BIT_ACCESS(WDTCON,5)
// WDTCON<ULPSINK>
extern volatile __bit                   ULPSINK             __at(0x7E89);	// @ (0xFD1 * 8 + 1)
#define                                 ULPSINK_bit         _BIT_ACCESS(WDTCON,1)
// PORTA<ULPWUIN>
extern volatile __bit                   ULPWUIN             __at(0x7C00);	// @ (0xF80 * 8 + 0)
#define                                 ULPWUIN_bit         _BIT_ACCESS(PORTA,0)
// ADCON1<VCFG0>
extern volatile __bit                   VCFG0               __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG01>
extern volatile __bit                   VCFG01              __at(0x7E0C);	// @ (0xFC1 * 8 + 4)
#define                                 VCFG01_bit          _BIT_ACCESS(ADCON1,4)
// ADCON1<VCFG1>
extern volatile __bit                   VCFG1               __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<VCFG11>
extern volatile __bit                   VCFG11              __at(0x7E0D);	// @ (0xFC1 * 8 + 5)
#define                                 VCFG11_bit          _BIT_ACCESS(ADCON1,5)
// HLVDCON<VDIRMAG>
extern volatile __bit                   VDIRMAG             __at(0x7D47);	// @ (0xFA8 * 8 + 7)
#define                                 VDIRMAG_bit         _BIT_ACCESS(HLVDCON,7)
// LCDREF<VLCD1PE>
extern volatile __bit                   VLCD1PE             __at(0x77E8);	// @ (0xEFD * 8 + 0)
#define                                 VLCD1PE_bit         _BIT_ACCESS(LCDREF,0)
// LCDREF<VLCD2PE>
extern volatile __bit                   VLCD2PE             __at(0x77E9);	// @ (0xEFD * 8 + 1)
#define                                 VLCD2PE_bit         _BIT_ACCESS(LCDREF,1)
// LCDREF<VLCD3PE>
extern volatile __bit                   VLCD3PE             __at(0x77EA);	// @ (0xEFD * 8 + 2)
#define                                 VLCD3PE_bit         _BIT_ACCESS(LCDREF,2)
// ADCON1<VNCFG>
extern volatile __bit                   VNCFG               __at(0x7E0B);	// @ (0xFC1 * 8 + 3)
#define                                 VNCFG_bit           _BIT_ACCESS(ADCON1,3)
// PORTA<VREF_MINUS>
extern volatile __bit                   VREF_MINUS          __at(0x7C02);	// @ (0xF80 * 8 + 2)
#define                                 VREF_MINUS_bit      _BIT_ACCESS(PORTA,2)
// PORTA<VREF_PLUS>
extern volatile __bit                   VREF_PLUS           __at(0x7C03);	// @ (0xF80 * 8 + 3)
#define                                 VREF_PLUS_bit       _BIT_ACCESS(PORTA,3)
// BAUDCON1<W4E>
extern volatile __bit                   W4E                 __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 W4E_bit             _BIT_ACCESS(BAUDCON1,1)
// LCDPS<WA>
extern volatile __bit                   WA                  __at(0x77AC);	// @ (0xEF5 * 8 + 4)
#define                                 WA_bit              _BIT_ACCESS(LCDPS,4)
// PR2<WAIT0>
extern volatile __bit                   WAIT0               __at(0x7E5C);	// @ (0xFCB * 8 + 4)
#define                                 WAIT0_bit           _BIT_ACCESS(PR2,4)
// PR2<WAIT1>
extern volatile __bit                   WAIT1               __at(0x7E5D);	// @ (0xFCB * 8 + 5)
#define                                 WAIT1_bit           _BIT_ACCESS(PR2,5)
// RTCVALH<WAITB0>
extern volatile __bit                   WAITB0              __at(0x7AEE);	// @ (0xF5D * 8 + 6)
#define                                 WAITB0_bit          _BIT_ACCESS(RTCVALH,6)
// RTCVALH<WAITB1>
extern volatile __bit                   WAITB1              __at(0x7AEF);	// @ (0xF5D * 8 + 7)
#define                                 WAITB1_bit          _BIT_ACCESS(RTCVALH,7)
// RTCVALH<WAITE0>
extern volatile __bit                   WAITE0              __at(0x7AE8);	// @ (0xF5D * 8 + 0)
#define                                 WAITE0_bit          _BIT_ACCESS(RTCVALH,0)
// RTCVALH<WAITE1>
extern volatile __bit                   WAITE1              __at(0x7AE9);	// @ (0xF5D * 8 + 1)
#define                                 WAITE1_bit          _BIT_ACCESS(RTCVALH,1)
// RTCVALH<WAITM0>
extern volatile __bit                   WAITM0              __at(0x7AEA);	// @ (0xF5D * 8 + 2)
#define                                 WAITM0_bit          _BIT_ACCESS(RTCVALH,2)
// RTCVALH<WAITM1>
extern volatile __bit                   WAITM1              __at(0x7AEB);	// @ (0xF5D * 8 + 3)
#define                                 WAITM1_bit          _BIT_ACCESS(RTCVALH,3)
// RTCVALH<WAITM2>
extern volatile __bit                   WAITM2              __at(0x7AEC);	// @ (0xF5D * 8 + 4)
#define                                 WAITM2_bit          _BIT_ACCESS(RTCVALH,4)
// RTCVALH<WAITM3>
extern volatile __bit                   WAITM3              __at(0x7AED);	// @ (0xF5D * 8 + 5)
#define                                 WAITM3_bit          _BIT_ACCESS(RTCVALH,5)
// SSP1CON1<WCOL1>
extern volatile __bit                   WCOL1               __at(0x7E37);	// @ (0xFC6 * 8 + 7)
#define                                 WCOL1_bit           _BIT_ACCESS(SSP1CON1,7)
// SSP2CON1<WCOL2>
extern volatile __bit                   WCOL2               __at(0x77FF);	// @ (0xEFF * 8 + 7)
#define                                 WCOL2_bit           _BIT_ACCESS(SSP2CON1,7)
// LCDCON<WERR>
extern volatile __bit                   WERR                __at(0x77A5);	// @ (0xEF4 * 8 + 5)
#define                                 WERR_bit            _BIT_ACCESS(LCDCON,5)
// LCDPS<WFT>
extern volatile __bit                   WFT                 __at(0x77AF);	// @ (0xEF5 * 8 + 7)
#define                                 WFT_bit             _BIT_ACCESS(LCDPS,7)
// PR2<WM0>
extern volatile __bit                   WM0                 __at(0x7E58);	// @ (0xFCB * 8 + 0)
#define                                 WM0_bit             _BIT_ACCESS(PR2,0)
// PR2<WM1>
extern volatile __bit                   WM1                 __at(0x7E59);	// @ (0xFCB * 8 + 1)
#define                                 WM1_bit             _BIT_ACCESS(PR2,1)
// PORTE<WRE>
extern volatile __bit                   WRE                 __at(0x7C21);	// @ (0xF84 * 8 + 1)
#define                                 WRE_bit             _BIT_ACCESS(PORTE,1)
// EECON1<WREN>
extern volatile __bit                   WREN                __at(0x7BFA);	// @ (0xF7F * 8 + 2)
#define                                 WREN_bit            _BIT_ACCESS(EECON1,2)
// EECON1<WRERR>
extern volatile __bit                   WRERR               __at(0x7BFB);	// @ (0xF7F * 8 + 3)
#define                                 WRERR_bit           _BIT_ACCESS(EECON1,3)
// PORTJ<WRH>
extern volatile __bit                   WRH                 __at(0x7C43);	// @ (0xF88 * 8 + 3)
#define                                 WRH_bit             _BIT_ACCESS(PORTJ,3)
// PORTJ<WRL>
extern volatile __bit                   WRL                 __at(0x7C42);	// @ (0xF88 * 8 + 2)
#define                                 WRL_bit             _BIT_ACCESS(PORTJ,2)
// BAUDCON1<WUE1>
extern volatile __bit                   WUE1                __at(0x7B29);	// @ (0xF65 * 8 + 1)
#define                                 WUE1_bit            _BIT_ACCESS(BAUDCON1,1)
// BAUDCON2<WUE2>
extern volatile __bit                   WUE2                __at(0x7901);	// @ (0xF20 * 8 + 1)
#define                                 WUE2_bit            _BIT_ACCESS(BAUDCON2,1)
// STATUS<ZERO>
extern volatile __bit                   ZERO                __at(0x7EC2);	// @ (0xFD8 * 8 + 2)
#define                                 ZERO_bit            _BIT_ACCESS(STATUS,2)
// SSP2STAT<nA2>
extern volatile __bit                   nA2                 __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 nA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SSP2STAT<nADDRESS2>
extern volatile __bit                   nADDRESS2           __at(0x7805);	// @ (0xF00 * 8 + 5)
#define                                 nADDRESS2_bit       _BIT_ACCESS(SSP2STAT,5)
// RCON<nBOR>
extern volatile __bit                   nBOR                __at(0x7E80);	// @ (0xFD0 * 8 + 0)
#define                                 nBOR_bit            _BIT_ACCESS(RCON,0)
// RCON<nCM>
extern volatile __bit                   nCM                 __at(0x7E85);	// @ (0xFD0 * 8 + 5)
#define                                 nCM_bit             _BIT_ACCESS(RCON,5)
// ADCON0<nDONE>
extern volatile __bit                   nDONE               __at(0x7E11);	// @ (0xFC2 * 8 + 1)
#define                                 nDONE_bit           _BIT_ACCESS(ADCON0,1)
// RCON<nPD>
extern volatile __bit                   nPD                 __at(0x7E82);	// @ (0xFD0 * 8 + 2)
#define                                 nPD_bit             _BIT_ACCESS(RCON,2)
// RCON<nPOR>
extern volatile __bit                   nPOR                __at(0x7E81);	// @ (0xFD0 * 8 + 1)
#define                                 nPOR_bit            _BIT_ACCESS(RCON,1)
// INTCON2<nRBPU>
extern volatile __bit                   nRBPU               __at(0x7F8F);	// @ (0xFF1 * 8 + 7)
#define                                 nRBPU_bit           _BIT_ACCESS(INTCON2,7)
// RCSTA1<nRC8>
extern volatile __bit                   nRC8                __at(0x7D5E);	// @ (0xFAB * 8 + 6)
#define                                 nRC8_bit            _BIT_ACCESS(RCSTA1,6)
// RCON<nRI>
extern volatile __bit                   nRI                 __at(0x7E84);	// @ (0xFD0 * 8 + 4)
#define                                 nRI_bit             _BIT_ACCESS(RCON,4)
// T1GCON<nT1DONE>
extern volatile __bit                   nT1DONE             __at(0x7D53);	// @ (0xFAA * 8 + 3)
#define                                 nT1DONE_bit         _BIT_ACCESS(T1GCON,3)
// T1CON<nT1SYNC>
extern volatile __bit                   nT1SYNC             __at(0x7E6A);	// @ (0xFCD * 8 + 2)
#define                                 nT1SYNC_bit         _BIT_ACCESS(T1CON,2)
// T3GCON<nT3DONE>
extern volatile __bit                   nT3DONE             __at(0x7D83);	// @ (0xFB0 * 8 + 3)
#define                                 nT3DONE_bit         _BIT_ACCESS(T3GCON,3)
// T3CON<nT3SYNC>
extern volatile __bit                   nT3SYNC             __at(0x7D8A);	// @ (0xFB1 * 8 + 2)
#define                                 nT3SYNC_bit         _BIT_ACCESS(T3CON,2)
// T5GCON<nT5DONE>
extern volatile __bit                   nT5DONE             __at(0x7893);	// @ (0xF12 * 8 + 3)
#define                                 nT5DONE_bit         _BIT_ACCESS(T5GCON,3)
// T5CON<nT5SYNC>
extern volatile __bit                   nT5SYNC             __at(0x789A);	// @ (0xF13 * 8 + 2)
#define                                 nT5SYNC_bit         _BIT_ACCESS(T5CON,2)
// T7GCON<nT7DONE>
extern volatile __bit                   nT7DONE             __at(0x79E3);	// @ (0xF3C * 8 + 3)
#define                                 nT7DONE_bit         _BIT_ACCESS(T7GCON,3)
// T7CON<nT7SYNC>
extern volatile __bit                   nT7SYNC             __at(0x79EA);	// @ (0xF3D * 8 + 2)
#define                                 nT7SYNC_bit         _BIT_ACCESS(T7CON,2)
// RCON<nTO>
extern volatile __bit                   nTO                 __at(0x7E83);	// @ (0xFD0 * 8 + 3)
#define                                 nTO_bit             _BIT_ACCESS(RCON,3)
// TXSTA1<nTX8>
extern volatile __bit                   nTX8                __at(0x7D66);	// @ (0xFAC * 8 + 6)
#define                                 nTX8_bit            _BIT_ACCESS(TXSTA1,6)
// SSP2STAT<nW2>
extern volatile __bit                   nW2                 __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 nW2_bit             _BIT_ACCESS(SSP2STAT,2)
// SSP2STAT<nWRITE2>
extern volatile __bit                   nWRITE2             __at(0x7802);	// @ (0xF00 * 8 + 2)
#define                                 nWRITE2_bit         _BIT_ACCESS(SSP2STAT,2)

#endif // _PIC18F86K90_H_
